[
  {
    "id": "patch-1754436443534-42ihfd4fp",
    "title": "Launch Week Devblog",
    "date": "2025-07-30",
    "version": "Unknown",
    "steamUrl": "<![CDATA[https://store.steampowered.com/news/app/1283700/view/516342955916656643]]>",
    "summary": "<p class=\"bb_paragraph\">Salutations SUPERVIVERS!</p><p class=\"bb_paragraph\">Whenever we shipped a patch in Open Beta or pre-alpha, we’d often spend time on Discord discussing the changes with players ...",
    "changes": {},
    "rawContent": "<p class=\"bb_paragraph\">Salutations SUPERVIVERS!</p><p class=\"bb_paragraph\">Whenever we shipped a patch in Open Beta or pre-alpha, we’d often spend time on Discord discussing the changes with players in a megathread. Now that we’ve hit 1.0(!) we’re looking for more ways to bring that experience to a wider audience, so we’re going to test writing our thoughts here on Steam. Let us know if you like the format or have any additional things you’d like to see.</p><p class=\"bb_paragraph\"></p><p class=\"bb_paragraph\">OK! Let’s talk about that 1.0 release! We just pushed out <a class=\"bb_link\" href=\"https://store.steampowered.com/news/app/1283700/view/516342955916656641\" target=\"_blank\" rel=\"\" >our first hotfix - you can read those notes here</a> if you’re just looking for the changes without so much of the blathering. </p><p class=\"bb_paragraph\"></p><div class=\"bb_h1\">Armory </div><p class=\"bb_paragraph\">Starting off with the big one. We know there’s a ton of player discussion about the Armory - it’s a big shift in how you earn equipment, customize your Hunters, and upgrade gear over the course of a season. We appreciate everyone who’s shared their feedback and critiques throughout the first few days of launch. Let’s cover a couple of the topics we’re seeing raised most frequently and what we’re doing about them. </p><div class=\"bb_h2\">Randomness</div><p class=\"bb_paragraph\">One of the most common criticisms we’re seeing of the Armory is that there’s too much randomness in how you unlock items. We think this feedback is fair, and we are discussing both short and long-term ways to improve agency.<br><br>In the short term, we’ve reduced the Prisma crafting cost of daily & weekly specials in the Forge to 1000 Prisma each, as well as increasing the number of items on offer. Our goal with these specials was to appeal to players looking for more agency, but their previous crafting cost was too expensive relative to capsules - and they weren’t really feeling like viable options. For anyone who crafted items from the Forge before the price reductions, we’ll be refunding you the difference via the in-game mailbox (just…give us a few days, there’s a lot going on lol).</p><p class=\"bb_paragraph\"></p><p class=\"bb_paragraph\"><img src=\"https://clan.fastly.steamstatic.com/images/45129184/5faa054b1e207724aa62e1a9ed38cb85bcc83eb4.png\" /></p><p class=\"bb_paragraph\">In the long-term, we want to give you more ways to chase equipment or invest into certain ones to power up, rather than relying purely on the RNG gods. We’re still in early prototypes for these systems, but we'll share more information as we get further along.</p><p class=\"bb_paragraph\"></p><p class=\"bb_paragraph\">We’re also improving a poor experience on the capsule side, by adding “bad-luck protection” to make sure no one can go too long without rolling a legendary capsule.</p><div class=\"bb_h2\">Prisma Progression</div><p class=\"bb_paragraph\">Another thing we’re seeing is discussion about overall Prisma earn rates and concerns of falling behind the average player (and then not being able to compete). We’re just a few days into the start of the season, but there’s a few changes we’re looking to implement. </p><div class=\"bb_h3\">Catch-Up Mechanics</div><p class=\"bb_paragraph\">One system we haven’t talked about before is in-world equipment drops - specifically, how items you find in-game have their star level determined. In every game, we take the average star and rarity rating of the lobby's Armory, and then apply that average to the strength of Relics found in vaults and random drops in the world (in summary: random gear drops match the lobby’s progression). </p><p class=\"bb_paragraph\"> </p><p class=\"bb_paragraph\">Up until now, equipment was dropping so rarely in-game that this was difficult to notice. We’d like for Vaults to be a more reliable source of in-game equipment, so we’ve adjusted all Vaults to guarantee at <i>least</i> one grip or relic. These vault equipment drops have a base 20% chance to be 2 star, and as the season goes on, you’ll start to see 2 or 3 star equipment drop in the world more frequently. We know this isn’t a complete solution, but it should give you another avenue to get Relics of equivalent power to the lobby you're playing in, even if you haven't made as much progress in your personal Armory.</p><p class=\"bb_paragraph\"></p><p class=\"bb_paragraph\"><img src=\"https://clan.fastly.steamstatic.com/images/45129184/689e781e2f95ef7e199ee00b1736ddfca8b4b298.png\" /></p><p class=\"bb_paragraph\">Besides in-game equipment, we have a few additional catch-up mechanics in the game - like having a significant amount of Prisma rewards in daily quests, weekly quests, and the Weekly Bounty - so even an infrequent player still has access to sources of prisma. (Speaking of - the first Weekly Bounty is available to open tomorrow, and at higher tiers, includes a choice between 3 legendary relics). But we’re hearing from you that these still don’t feel like enough. In the short-term, we’ve increased the rewards from daily quests from 100 prisma each to 400 prisma each, while in the longer-term, we’re exploring ways to make sure players who join later in the season don’t feel far behind the curve. </p><p class=\"bb_paragraph\"></p><p class=\"bb_paragraph\"><img src=\"https://clan.fastly.steamstatic.com/images/45129184/2a3e797b43bb6f23d86da20f64ec6b3795697dc2.png\" /></p><p class=\"bb_paragraph\"></p><div class=\"bb_h3\">Placement Prisma Rewards</div><p class=\"bb_paragraph\">Playing well in SUPERVIVE should come with additional rewards, but looking at the numbers from our first week, it’s clear the current balance is skewed way too heavily toward first place. Sometimes the top-placing team earns more Prisma than the rest of the lobby put together! We’ve got a suite of changes to make this a little less extreme, so winning is still the best way to earn Prisma, but not at the cost of everyone else getting so little. </p><ul class=\"bb_ul\"><li><p class=\"bb_paragraph\">We’ve buffed the overall Prisma gains from both PvE and PvP interactions</p></li><li><p class=\"bb_paragraph\">We’ve reduced the amount of Prisma you drop per death from 50% >>> 33%</p></li><li><p class=\"bb_paragraph\">We’ve increased the minimum amount of Prisma received from kills from 8 >>> 15 (this is a guaranteed amount, even if the killed player had less)</p></li><li><p class=\"bb_paragraph\">We’ve slightly decreased the Prisma multiplier for top 3 lobby placement, and increased the multiplier for placing 5th or 6th</p></li></ul><p class=\"bb_paragraph\">In combination with the additional Prisma in daily quests, the end result of all these changes should be that <b>everyone</b> is earning more Prisma over time, and the Prisma reward for Ws still feels good without leaving the rest of the lobby with scraps.</p><p class=\"bb_paragraph\"></p><div class=\"bb_h1\">Arena</div><p class=\"bb_paragraph\">Though most players choose Breach as their main mode, Arena has always had a loyal following. With 1.0, we’ve seen many Arena players tell us that they feel neglected - especially with Arena games not earning Prisma. This is something that we were hoping to get in for a later patch, but we’ve been able to pull it forward to this hotfix. As a caveat: our goal isn’t to make Arena the most efficient way to grind Prisma, but we do want it be something that respects players time. </p><p class=\"bb_paragraph\"></p><p class=\"bb_paragraph\">And, more good news for Arena players! We’ve got some visual upgrades planned for the near future. We’re excited to give these maps some more love. </p><p class=\"bb_paragraph\"></p><p class=\"bb_paragraph\"><img src=\"https://clan.fastly.steamstatic.com/images/45129184/dbbb30b481b963177a731958619921611b151da9.png\" /></p><div class=\"bb_h1\">Balance</div><p class=\"bb_paragraph\">The biggest balance area we’re keeping an eye on right now is characters with dunking abilities. With the updated glider and map layout, several of our resident dunkers are starting to feel more oppressive - especially in heavy abyss endgames. We’re exploring some wider changes that include making dunks feel a little less binary and addressing unintended glider momentum optimizations (slightly), which we plan to ship in a later patch. </p><p class=\"bb_paragraph\"></p><p class=\"bb_paragraph\">We’re also keeping an eye on individual Hunter winrates across different MMRs to see how everyone’s adjusting to their best 1.0 selves. We only have a few days of data to work with, but there are some outliers that we’re looking to fix before resuming our biweekly balance cadence. Brall and Shiv received some nerfs earlier over the weekend, and we’re making some additional adjustments to Wukong and Jin’s movement so their LMBs don’t make them quite so slippery. </p><p class=\"bb_paragraph\"></p><p class=\"bb_paragraph\">Throughout SUPERVIVE’s alpha and beta, we’ve always valued player feedback as one of the main inputs for us to make the game better - that’s not changing now that we’re in 1.0. We’ll be back next week with our first (real) patch, along with a rocking new Hunter. See you there! </p><p class=\"bb_paragraph\"></p><p class=\"bb_paragraph\"><img src=\"https://clan.fastly.steamstatic.com/images/45129184/8ce7d8277073c5bce471ef084a05d76a82207691.png\" /></p><p class=\"bb_paragraph\">~ the ViV team</p><p class=\"bb_paragraph\"></p>",
    "addedAt": "2025-08-05T23:27:23.559Z"
  },
  {
    "id": "patch-1754436443561-1movnunkr",
    "title": "JUNE 25 PATCH - Bugfixing on the road to 1.0!",
    "date": "2025-06-25",
    "version": "1.0",
    "steamUrl": "<![CDATA[https://store.steampowered.com/news/app/1283700/view/580514905803724092]]>",
    "summary": "<b>NOTE: THIS PATCH WILL NOT BE LIVE UNTIL JUNE 25, 2025 @ 8AM PT / 11AM ET / 5PM CET / 12AM KST</b><br><br>Salutations SUPERVIVERs - it’s time for a big list of bugfixes.",
    "changes": {},
    "rawContent": "<b>NOTE: THIS PATCH WILL NOT BE LIVE UNTIL JUNE 25, 2025 @ 8AM PT / 11AM ET / 5PM CET / 12AM KST</b><br><br>Salutations SUPERVIVERs - it’s time for a big list of bugfixes. <a class=\"bb_link\" href=\"https://store.steampowered.com/news/app/1283700/view/516337249186483633\" target=\"_blank\" rel=\"\" >I mentioned this last patch</a> but we’re heads down polishing up 1.0 behind closed doors and it’s getting increasingly more complex to ship changes to the live build. There’s a technical explanation here (we’re working entirely off our 1.0 branch and integrating individual CLs to the live build), but the short of it is: you get bugfixes! Lots of bugfixes!<br><br>We’ll keep track of our master list of bugfixes here and on Discord. And as a reminder - there are any big, emergent issues you spot leading up to 1.0, let us know on our bug tracking board on Discord. We read that every day!<br><br>Okay, see y’all in a bit.<br><div class=\"bb_h1\">Bugfixes</div><div class=\"bb_h3\">Hunters:</div><ul class=\"bb_ul\"><li>Beebo can no longer speed himself up during Tonk Tonk (R) by yoinking himself forward with Pull Zeep (RMB) (hilarious)<br></li><li>Beebo’s Tonk Tonk! (R) no longer snaps affected player's camera to origin for a frame…<br></li><li>Beebo’s Super Zeep (RMB) should more reliably hit targets above / below Beebo<br></li><li>Beebo’s healthbar no longer detaches at the end of his Recall (B) animation<br></li><li>Void’s Empowered state now correctly increases the size of Black Hole ®<br></li><li>Void’s Singularity (R) No longer destroys allied destructibles when cast after them<br></li><li>Void’s Empowered state now correctly shows on base skin<br></li><li>Felix’s Zero Star skin Embry Bolt (RMB) VFX now more closely match the spell's functional width<br></li><li>Ghost / Saros no longer have their model hidden when interrupting Recall (B) with RMB<br></li><li>The following Hunter spells with charges now correctly get reset on Team Wipe: Eva's Orb of Argos (RMB) and Saros' Eclipse Portal ®<br></li><li>Shrike’s Truetalon Rifle (LMB)'s laser correctly climbs high ground from an enemy perspective<br></li><li>Shrike’s Full Bore (R) now more smoothly updates its telegraph from an enemy perspective</li></ul><ul class=\"bb_ul\"><li>Repeatedly Sneaking/Aiming-down-sights (Ctrl) in the Death Circle no longer causes the player to remain stuck in a Sneak/Aim-down-sights state<br></li><li>Bosses now all move again after landing (whoops!)</li></ul>",
    "addedAt": "2025-08-05T23:27:23.568Z"
  },
  {
    "id": "patch-1754436443568-s11ap6a69",
    "title": "JUNE 11 PATCH - Warmup, Challenge Rooms, Balancing, and more!",
    "date": "2025-06-11",
    "version": "Unknown",
    "steamUrl": "<![CDATA[https://store.steampowered.com/news/app/1283700/view/516337249186483633]]>",
    "summary": "<b>NOTE: THIS PATCH WILL NOT BE LIVE UNTIL JUNE 11, 2025 @ 8:00AM</b><br><br><blockquote class=\"bb_blockquote with_author\"><div class=\"bb_quoteauthor\">#Discussions_QuoteBlock_Author</div>WE MARCH ALON...",
    "changes": {},
    "rawContent": "<b>NOTE: THIS PATCH WILL NOT BE LIVE UNTIL JUNE 11, 2025 @ 8:00AM</b><br><br><blockquote class=\"bb_blockquote with_author\"><div class=\"bb_quoteauthor\">#Discussions_QuoteBlock_Author</div>WE MARCH ALONG THE ROAD TO 1.0! Welcome to our June 11th patch, which will likely be our last ‘big’ patch until 1.0. Just to give context: we’re basically working on two versions of SUPERVIVE - the future ‘1.0’ version, and the current ‘live’ version. Now, as we’ve said every patch: <b>1.0 will be a significant evolution of SUPERVIVE as we know it.</b> Meaning entirely new systems and way of playing the game. We think this is necessary because the current version of SUPERVIVE is simply not working as-is—so we gotta be brave and bold.<br><br>But any game developer will tell you that maintaining two separate ‘versions’ of a game is, bluntly, a pain in the ass. So as we get closer to our 1.0 release date and have a China beta test going on, we’ve pulled in some isolated features we want to test on live, and will henceforth start banking changes, bugfixes, etc, for the future. This’ll make more sense when you see the next patch, but just giving you a heads up. Also if you see any weird changes referencing 1.0 things (what could they be!?), pardon our dust.</blockquote><div class=\"bb_h1\">Warmup</div><blockquote class=\"bb_blockquote with_author\"><div class=\"bb_quoteauthor\">#Discussions_QuoteBlock_Author</div>It’s HAPPENING!? Learn new hunters! Get your combat reps fast and without judgement!! Frag out with no expectations!!! Come on into the warm up.</blockquote><ul class=\"bb_ul\"><li>We’ve added a Warm Up mode - a new solo practice queue where you will be placed in an endless free-for-all deathmatch map on a Hunter of your choice<ul class=\"bb_ul\"><li>You will automatically enter Warm Up mode while waiting in queue<br></li><li>You will always join the same session as your party members (but you will all have to fight each other)<br></li><li>You can disable automatically joining Warmup in your game settings<br></li><li>You can enter Warm Up mode separately without having to be in a separate queue</li></ul></li></ul><b>Details:</b><ul class=\"bb_ul\"><li>You’ll be spawned into a random slice of Skylands where you’ll battle against other players and bots of similar skill level.<br></li><li>All hunters will start at max level, have an infinite number of vive brews, and have epic tier equipment<br></li><li>There is also a global shop to try different equipment combinations or purchase powers<br></li><li>You can change your Hunter on death<br></li><li>In the top right you can see a leaderboard of the longest killstreaks in your current lobby.<br></li><li>While you're in a Warm Up session, you can still queue for other game modes. As a result, players may join or leave the session at different times<br></li><li>After a fixed amount of time, the session will end and reset in a new area of skylands</li></ul><div class=\"bb_h1\">Practice</div><ul class=\"bb_ul\"><li>Your party leader pulls you into practice only if you are in menus. They will not pull you out of a game (this includes spectating a match).<br></li><li>Each member can join/leave their party’s practice session as they please</li></ul><div class=\"bb_h1\">Tutorial</div><ul class=\"bb_ul\"><li>We’ve added a new tutorial that covers the basics<br></li><li>Completing the tutorial will reward you with a Hunter unlock: Ghost</li></ul><div class=\"bb_h1\">Challenge Rooms</div><ul class=\"bb_ul\"><li>There are now three new Challenge Rooms with new objectives to test different skills across: Traversal, Spiking, Objectives, Bosses, and Vaults. Try them out to get rewards!</li></ul><div class=\"bb_h1\">Circle Damage</div><blockquote class=\"bb_blockquote with_author\"><div class=\"bb_quoteauthor\">#Discussions_QuoteBlock_Author</div>Doing a little preemptive tuning for our 1.0 changes. Also, philosophically it makes sense.</blockquote><ul class=\"bb_ul\"><li>Circle Damage now deals true damage and cannot be mitigated by any form of damage mitigation (Armor, Equipment, etc)</li></ul><div class=\"bb_h1\">Most Wanted</div><ul class=\"bb_ul\"><li>Most Wanted's EXP completion reward no longer gives EXP above that day's level cap</li></ul><div class=\"bb_h1\">Directional Influence (DI)</div><blockquote class=\"bb_blockquote with_author\"><div class=\"bb_quoteauthor\">#Discussions_QuoteBlock_Author</div>We’ve heard feedback that repetitive knockbacks can be tilting, especially against Brall LMB. We’re introducing a new system to give knockback victims more control over the direction they’re impulsed by certain attacks. Simply put: your WASD movement input now affects the direction you’re sent when hit by certain knockback attacks. We’ll keep a close eye on this system to see if we should apply it to more attacks on a broader scale. We smash now?</blockquote><b>High DI Attacks</b> (victims have high influence over their knockback trajectory)<ul class=\"bb_ul\"><li>Brall LMB (all hits)<br></li><li>Beebo tap LMB<br></li><li>Jin LMB1</li></ul><b>Medium DI Attacks</b> (victims have moderate influence over their knockback trajectory)<ul class=\"bb_ul\"><li>Brall RMB (tap and hold)<br></li><li>Beebo hold LMB<br></li><li>Oath hold LMB<br></li><li>Oath shield bash<br></li><li>Saros dash knockback</li></ul><div class=\"bb_h1\">Hunters</div><blockquote class=\"bb_blockquote with_author\"><div class=\"bb_quoteauthor\">#Discussions_QuoteBlock_Author</div>Small tweaks based on feedback and observing general win rates. Additionally, we’ve been prioritizing Hunter-related bugfixes (thanks for your continued reports on Discord!) on the path to 1.0, which we’ll document here.</blockquote><div class=\"bb_h3\">Beebo</div><b>Slingshot (RMB)</b><ul class=\"bb_ul\"><li>BUGFIX: Super Zeep shot explosion now more reliably hits targets above / below Beebo's height<br></li><li>BUGFIX: Pull Zeep's impulse no longer affects Beebo during Tonk Tonk! (R)</li></ul><div class=\"bb_h3\">Shrike</div><ul class=\"bb_ul\"><li>BUGFIX: Truetalon Rifle (LMB) laser now climbs up highground from enemy PoV<br></li><li>BUGFIX: Scout Hawk (Q) Rank 4 now correctly shows its ward for the full duration from an enemy point-of-view<br></li><li>BUGFIX: Bird-Bomb (RMB) now reliably hits enemies when placed from highground</li></ul><div class=\"bb_h3\">Elluna</div><b>Soulpack (PASSIVE)</b><ul class=\"bb_ul\"><li>BUGFIX: Fixed a lot of cases where Elluna could drop her wisps accidentally:<ul class=\"bb_ul\"><li>Blinking / Teleporting away<br></li><li>Colliding with Bungee Shot wall<br></li><li>Bouncing off of Jellyfish / Tires<br></li><li>… and many more!</li></ul></li></ul><div class=\"bb_h3\">Felix</div><ul class=\"bb_ul\"><li>BUGFIX: Flamethrower (LMB) no longer temporarily loses functionality when cancelled at specific timing</li></ul><div class=\"bb_h3\">Zeph</div><b>Cyclone Dash (SHIFT)</b><ul class=\"bb_ul\"><li>Cooldown increased by 0.5 seconds at all levels</li></ul><div class=\"bb_h3\">Void</div><b>Swap (SHIFT)</b><ul class=\"bb_ul\"><li>Cooldown increased by 0.5 seconds at all levels<br></li><li>BUGFIX: Now correctly swaps Hunters / objects that are over Abyss</li></ul><div class=\"bb_h3\">Ghost</div><b>Spike Grenade (RMB)</b><ul class=\"bb_ul\"><li>Bonus damage to MK7 Glyph Rifle (LMB) decreased by 15%</li></ul><b>Combat Slide (SHIFT)</b><ul class=\"bb_ul\"><li>Cooldown increased by 0.5 seconds at all levels</li></ul><div class=\"bb_h3\">Saros</div><b>Charge Sunfire (RMB)</b><ul class=\"bb_ul\"><li>NOTE: We’ve been digging into the RMB-stutter bug where Saros won’t fire his empowered LMB and wastes the shot - it’s just more complicated than we thought, but we’re working on it!</li></ul><b>Dive Slash (SHIFT)</b><ul class=\"bb_ul\"><li>BUGFIX: Now correctly refreshes its cooldown on Staggering a minion</li></ul><b>Nova Orb (Q) </b><ul class=\"bb_ul\"><li>BUGFIX: No longer grants Saros Ionized if he detonates and hits a destructible<br></li><li>Saros now only gains Ionized if he hits an enemy hunter or minion</li></ul><b>Eclipse Portal (R)</b><ul class=\"bb_ul\"><li>BUGFIX: Should no longer re-teleport players immediately after they enter it</li></ul><div class=\"bb_h3\">Carbine</div><b>XT3 Heavy Blaster (LMB)</b><ul class=\"bb_ul\"><li>Reduced the bonus damage granted to the first shot of XT3 Heavy Blaster (LMB) by ~45%, down to 88 at the top end<br></li><li>This change also affects the empowered shot from Thrusters (SHIFT)</li></ul><b>Overkill Rounds (R)</b><ul class=\"bb_ul\"><li>Scaling changed to more evenly increase damage per level (+21%, +23%)<br></li><li>Slightly buffed the top end of damage to 615<br></li><li>BUGFIX: No longer incorrectly grants all of its damage increase at Rank 2 (instead, increases are spread between Rank 2 and Rank 3)</li></ul><div class=\"bb_h3\">Hudson</div><blockquote class=\"bb_blockquote with_author\"><div class=\"bb_quoteauthor\">#Discussions_QuoteBlock_Author</div>Giving him some much-needed buffs after his mini-rework.</blockquote><b>Spin Barrels (RMB)</b><ul class=\"bb_ul\"><li>Turn rate restriction at maximum heat 25°/sec >>> 45°/sec<br></li><li>Movespeed slow at maximum heat 80% >>> 70%<br></li><li>Spun-Up base bullet damage increased ~6.5% across all levels (AP ratios unchanged)</li></ul><b>Barbed Wire (Q)</b><ul class=\"bb_ul\"><li>Arm duration after deploying 0.6 >>> 0.45 seconds</li></ul><div class=\"bb_h3\">Shrike</div><ul class=\"bb_ul\"><li>Base movement speed increased from 475 >>> 490</li></ul><div class=\"bb_h3\">Oath </div><blockquote class=\"bb_blockquote with_author\"><div class=\"bb_quoteauthor\">#Discussions_QuoteBlock_Author</div>Shields > Lasers?</blockquote><b>Brightshield (RMB)</b><ul class=\"bb_ul\"><li>Shield is now Immune to Machine Lasers/Placeable Laser</li></ul><div class=\"bb_h1\">Items</div><ul class=\"bb_ul\"><li>EMP Grenades now deal 99999 damage to armor</li></ul><div class=\"bb_h1\">General Bugfixes</div><ul class=\"bb_ul\"><li>Hunters no longer say \"Nevermind\" when recalling to their teammates<br></li><li>Megamap should no longer be occasionally zoomed in fully for all players on match start<br></li><li>Audio: Base Camp Capture audio loops correctly again<br></li><li>Audio: Anomaly SFX now plays again<br></li><li>Audio: Recall Finished SFX should now play properly at the location where the Hunter has recalled to</li></ul><div class=\"bb_h1\">Quality-of-Life</div><b>Ally Incoming VO</b><ul class=\"bb_ul\"><li>We added Announcer VO when an ally is recalling to your position (\"Ally Incoming!\")<br></li><li>Doesn't trigger until you've been channeling for 1.3 seconds to avoid false alarms when you cancel early<br></li><li>10 second cooldown so that you can't spam your ally by repeatedly TP'ing to them<br></li><li>This is an anti-quality-of-life change but we had to make it for… reasons. We’ve removed equipment from your F1 informational overlay</li></ul><div class=\"bb_h1\">Supporter Pack Changes</div><ul class=\"bb_ul\"><li>We’ve decided to make the supporter pack pedestals permanent. If you’ve purchased one already or for any new buyer, you’ll get to keep these moving forward<br></li><li>In an upcoming patch we’re going to make it so Pedestals can be equipped, swapped, and changed!<br></li><li>The temporary XP bonuses in supporter packs are being removed. Existing buyers will not be affected</li></ul><div class=\"bb_h1\">Errata (things we shipped but failed to document last patch)</div><ul class=\"bb_ul\"><li>Fixed an issue where Kingpin’s hook would not properly pull bosses<br></li><li>Recalling to an ally now silences you for 5 seconds after the teleportation. Additionally, you get a 50% decaying slow until the silence is over. Silence means you cannot use abilities, powers, or consumables<br></li><li>When buying a blade or helm in the practice mode, you can directly choose which slot to use, and it won't instantly drop on the floor anymore<br></li><li>Elluna’s Moonlight Blessing (Q) tooltip was updated to accurately reflect its true values (nothing was changed)<br></li><li>Eva’s Beckon (Q) cooldown reduction per-level was updated to accurately reflect its true values (nothing was changed)<br></li><li>Void’s model has been update<br></li><li>The Final Boss is no longer Bubba or the Final Abyssal - he is the Lava Baron, aka Baron Immorius, ruler of the Chaos Steppes<br></li><li>Bubba has been renamed to >>> Immorius the Omniscient<br></li><li>Soul Warden has been renamed to >>> Immorius, Soul Warden<br></li><li>Gnarl has been renamed to >>> Immorius, Gnarled Baron</li></ul>",
    "addedAt": "2025-08-05T23:27:23.650Z"
  },
  {
    "id": "patch-july-30-2025",
    "title": "July 30 - Hotfix Patch Notes",
    "date": "2025-07-30",
    "version": "1.0.1",
    "steamUrl": "https://store.steampowered.com/news/app/1283700/view/516342955916656641",
    "summary": "Balance adjustments and progression improvements following the 1.0 launch, including Prisma Gem reward increases and hunter balance tweaks.",
    "changes": {
      "hunters": [
        {
          "description": "Brall and Shiv received nerfs over the weekend to address overperformance",
          "type": "nerf"
        },
        {
          "description": "Wukong and Jin's movement adjusted so their LMBs don't make them quite so slippery",
          "type": "nerf"
        },
        {
          "description": "Individual Hunter winrates being monitored across different MMRs for future balance adjustments",
          "type": "change"
        }
      ],
      "equipment": [
        {
          "description": "Prisma crafting cost of daily & weekly specials in the Forge reduced to 1000 Prisma each",
          "type": "buff"
        },
        {
          "description": "Increased the number of items on offer in the Forge specials",
          "type": "buff"
        },
        {
          "description": "All Vaults now guarantee at least one grip or relic",
          "type": "buff"
        },
        {
          "description": "Vault equipment drops have a base 20% chance to be 2 star",
          "type": "buff"
        },
        {
          "description": "Bad-luck protection added to legendary capsule drops",
          "type": "improvement"
        }
      ],
      "systems": [
        {
          "description": "Daily quest Prisma rewards increased: 100 → 400 per quest (300% increase)",
          "type": "buff"
        },
        {
          "description": "Overall Prisma gains from both PvE and PvP interactions buffed",
          "type": "buff"
        },
        {
          "description": "Prisma drop on death reduced: 50% → 33%",
          "type": "buff"
        },
        {
          "description": "Minimum Prisma received from kills increased: 8 → 15 (guaranteed amount)",
          "type": "buff"
        },
        {
          "description": "Prisma multiplier for top 3 lobby placement slightly decreased",
          "type": "nerf"
        },
        {
          "description": "Prisma multiplier for placing 5th or 6th increased",
          "type": "buff"
        }
      ],
      "maps": [
        {
          "description": "Monitoring characters with dunking abilities due to updated glider and map layout",
          "type": "change"
        }
      ],
      "modes": [
        {
          "description": "Arena mode now earns Prisma rewards (previously didn't reward Prisma)",
          "type": "new"
        },
        {
          "description": "Arena visual upgrades planned for near future",
          "type": "change"
        }
      ]
    },
    "rawContent": "Balance adjustments following 1.0 launch with focus on Prisma progression improvements and hunter balance tweaks.",
    "addedAt": "2025-08-04T22:20:00.000Z"
  },
  {
    "id": "patch-june-25-2025",
    "title": "June 25 - Bugfixing on the road to 1.0!",
    "date": "2025-06-25",
    "version": "0.25",
    "steamUrl": "https://store.steampowered.com/news/app/1283700/view/580514905803724092",
    "summary": "Comprehensive bugfix patch addressing hunter-specific issues ahead of the 1.0 launch.",
    "changes": {
      "hunters": [
        {
          "description": "Beebo: Can no longer speed himself up during Tonk Tonk (R) by using Pull Zeep (RMB)",
          "type": "fix"
        },
        {
          "description": "Beebo: Tonk Tonk! (R) no longer snaps camera to origin",
          "type": "fix"
        },
        {
          "description": "Beebo: Super Zeep (RMB) more reliably hits targets above/below",
          "type": "fix"
        },
        {
          "description": "Void: Empowered state now correctly increases Black Hole size",
          "type": "fix"
        },
        {
          "description": "Void: Singularity (R) no longer destroys allied destructibles",
          "type": "fix"
        },
        {
          "description": "Felix: Zero Star skin Embry Bolt (RMB) VFX now match functional width",
          "type": "fix"
        },
        {
          "description": "Ghost/Saros: Models no longer hidden when interrupting Recall with RMB",
          "type": "fix"
        },
        {
          "description": "Eva/Saros: Hunter spells with charges correctly reset on Team Wipe",
          "type": "fix"
        },
        {
          "description": "Shrike: Truetalon Rifle laser correctly climbs high ground",
          "type": "fix"
        }
      ],
      "equipment": [],
      "systems": [
        {
          "description": "Sneaking/Aiming in Death Circle no longer causes stuck state",
          "type": "fix"
        },
        {
          "description": "Bosses now move again after landing",
          "type": "fix"
        }
      ],
      "maps": [],
      "modes": []
    },
    "rawContent": "Major bugfix patch addressing numerous hunter-specific issues and system bugs ahead of 1.0 launch.",
    "addedAt": "2025-08-04T22:20:00.000Z"
  },
  {
    "id": "patch-june-11-2025",
    "title": "June 11 - Warmup, Challenge Rooms, Balancing, and more!",
    "date": "2025-06-11",
    "version": "0.24",
    "steamUrl": "https://store.steampowered.com/news/app/1283700/view/516337249186483633",
    "summary": "Major content update introducing Warmup mode, Challenge Rooms, Directional Influence system, and extensive hunter balance changes.",
    "changes": {
      "hunters": [
        {
          "description": "Zeph: Cyclone Dash cooldown increased by 0.5 seconds at all levels",
          "type": "nerf"
        },
        {
          "description": "Void: Swap cooldown increased by 0.5 seconds at all levels",
          "type": "nerf"
        },
        {
          "description": "Ghost: Spike Grenade bonus damage to MK7 Glyph Rifle decreased by 15%",
          "type": "nerf"
        },
        {
          "description": "Ghost: Combat Slide cooldown increased by 0.5 seconds at all levels",
          "type": "nerf"
        },
        {
          "description": "Carbine: XT3 Heavy Blaster first shot damage reduced by ~45%",
          "type": "nerf"
        },
        {
          "description": "Hudson: Turn rate restriction at max heat improved: 25°/sec → 45°/sec",
          "type": "buff"
        },
        {
          "description": "Hudson: Movement speed slow at max heat reduced: 80% → 70%",
          "type": "buff"
        },
        {
          "description": "Hudson: Spun-Up base bullet damage increased ~6.5%",
          "type": "buff"
        },
        {
          "description": "Hudson: Barbed Wire arm duration: 0.6s → 0.45s",
          "type": "buff"
        },
        {
          "description": "Shrike: Base movement speed increased: 475 → 490",
          "type": "buff"
        },
        {
          "description": "Oath: Brightshield now immune to Machine Lasers/Placeable Lasers",
          "type": "buff"
        },
        {
          "description": "Multiple hunter bugfixes for Beebo, Shrike, Elluna, Felix, Saros",
          "type": "fix"
        }
      ],
      "equipment": [
        {
          "description": "EMP Grenades now deal 99999 damage to armor",
          "type": "buff"
        }
      ],
      "systems": [
        {
          "description": "Circle Damage now deals true damage, cannot be mitigated",
          "type": "change"
        },
        {
          "description": "Most Wanted EXP completion reward capped at daily level limit",
          "type": "change"
        },
        {
          "description": "Directional Influence (DI) system introduced for knockback control",
          "type": "new"
        },
        {
          "description": "Supporter pack pedestals made permanent",
          "type": "improvement"
        }
      ],
      "maps": [
        {
          "description": "Audio fixes: Base Camp Capture, Anomaly SFX, Recall SFX",
          "type": "fix"
        },
        {
          "description": "Megamap zoom issue fixed",
          "type": "fix"
        }
      ],
      "modes": [
        {
          "description": "Warmup mode added - endless deathmatch practice while queueing",
          "type": "new"
        },
        {
          "description": "Challenge Rooms added - 3 new rooms testing different skills",
          "type": "new"
        },
        {
          "description": "Tutorial added - covers basics and rewards Ghost unlock",
          "type": "new"
        },
        {
          "description": "Practice mode improvements - better party management",
          "type": "improvement"
        }
      ]
    },
    "rawContent": "Major feature update introducing Warmup mode, Challenge Rooms, and extensive balance changes in preparation for 1.0.",
    "addedAt": "2025-08-04T22:20:00.000Z"
  }
]